BusinessProcesses/ИзменитьПользователяИнформационнойБазыАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<BusinessProcess>
		<Properties>
			<Name>ИзменитьПользователяИнформационнойБазыАИТП</Name>
			<Task>Task.ЗадачаАИТП</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИзменитьИмя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПолноеИмя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьАутентификацияСтандартная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьАутентификацияОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПользовательОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьЗапрещеноИзменятьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноИзменятьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьАутентификацияOpenID</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияOpenID</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПредупреждатьОбОпасныхДействиях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьОбОпасныхДействиях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалятьПарольПриЗавершении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьЯзык</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьРоли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ВидыЗадачАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыЗадачАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДальнейшиеДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продолжить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ИзменитьПользователяИнформационнойБазыАИТП/Ext/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПередСтартомБП(
			ТочкаМаршрутаБизнесПроцесса,
			ЭтотОбъект
		);
		
КонецПроцедуры

Процедура ИзменитьПользователяИнформационнойБазыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриСозданииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			ФормируемыеЗадачи[0],
			Перечисления.ВидыЗадачАИТП.Действие,
			"ИзменитьПользователейИнформационнойБазыАИТП"
		);
			
КонецПроцедуры

Процедура ИзменитьПользователяИнформационнойБазыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			Задача
		);
		
КонецПроцедуры

Процедура РезультатИзмененияПользователяОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаРезультатПоложительныйОтрицательныйОшибка(
			ТочкаВыбораВарианта,
			ЭтотОбъект,
			БизнесПроцессы.ИзменитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ИзменитьПользователяИнформационнойБазы
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуИзмененияПользователяИБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	Задача = БизнесПроцессыАИТП.ПолучитьИнформациюОПоследнейВыполненнойЗадаче(
			ЭтотОбъект,
			БизнесПроцессы.ИзменитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ИзменитьПользователяИнформационнойБазы
		).Задача;
		
	ФормируемыеЗадачи[0].ОшибкаДляОбработки = Задача.Ошибка;
	
	БизнесПроцессыАИТП.ПриСозданииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			ФормируемыеЗадачи[0],
			Перечисления.ВидыЗадачАИТП.ОбработкаОшибки
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуИзмененияПользователяИБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			Задача
		);
		
КонецПроцедуры

Процедура ДальнейшиеДействияОбработатьОшибкуИзмененияПользователяИБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаПродолжитьПовторитьЗавершитьОтменить(
			ТочкаВыбораВарианта,
			ЭтотОбъект,
			БизнесПроцессы.ИзменитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ОбработатьОшибкуИзмененияПользователяИБ
		);
		
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	БизнесПроцессыАИТП.ПриЗавершенииБП(
			ТочкаМаршрутаБизнесПроцесса
			, ЭтотОбъект
			, Перечисления.РезультатыВыполненияДействияАИТП.Положительный
			, Перечисления.ДальнейшиеДействияАИТП.Продолжить
		);
		
КонецПроцедуры

Процедура УстановитьПароль(Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	КонфиденциальныеДанныеАИТП.ВставитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка,, ПолучитьДвоичныеДанныеИзСтроки(Пароль));
	
КонецПроцедуры

Процедура ЗавершениеОтменитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Отменить
		);

КонецПроцедуры

Процедура ЗавершениеЗавершитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
		
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Завершить
		);

КонецПроцедуры

#КонецОбласти
